void main(List<String> args) {
  /*
   1、String 字符串，包含一系列UTF-16代码单元。可以使用 单引号 或 双引号 创建一个字符串。
    语法：
      String 变量名 = '字符串内容';

   
   2、插值表达式，用于在字符串中插入值：
     $identifier：把 identifier 标识符的值插入字符串中。
     ${expression} ：把 表达式expression 返回的值插入字符串中。
   */

  var s1 = "string string";
  String s2 = 'string string';
  var text = 'text is $s1, ${s2.toUpperCase()}';
  print('定义字符串变量，使用插值表达式: $text');   // 打印：text is string string, STRING STRING
  String content = '我在${DateTime.now()}起床！';
  print("--- content = $content");

  /*
    2、字符串拼接
      方式1，使用并列放置多个字符串字面量；
      方式2，+ 运算符；
   */
  var c1 = 'a'"B"'c';
  var c2 = '1'
          "22"
          '333';
  var c3 = c1 + c2;
  print('字符串拼接: c1 = $c1, c2 = $c2, c3 = $c3');

  /**
    3、多行字符串
     使用带 单引号或双引号的 三引号来创建多行字符串。
   */
  var m1 = """
  山前明月光，
  疑是地上霜。
  """;
  var m2 = '''
  举头望明月，
  低头思故乡。
  ''';
  print('多行字符串: $m1 $m2');
  
  /**
   * 4、禁止字符串转义
   * 通过添加 r 前缀来创建“原始”字符串
   */
  var r = r'aaa \n bbb';
  print('禁止字符串转义: r = $r');    // 打印：r = aaa \n bbb

  /**
   * 5、.length，获取字符串的长度
   */
  var l = '开心😄下雨☔️';
  print('字符串长度, string.length = ${l.length}, .runes.length = ${l.runes.length} \n');   //  string.length = 8, .runes.length = 7

  // 6、字符串截取
  String rangStr = '你好世界！';
  print('从索引1开始到索引3的字符: ${rangStr.substring(1, 3)}');    // 打印：好世
  int index = rangStr.indexOf('世界');
  print('获取指定字符串位置: $index、${rangStr.substring(index, index + '世界'.length)}');     // 打印：2、世界

  

}